### Importing the Packages

In [1]:
import pandas as pd
import numpy as np

### Importing the data

In [23]:
url = './ignore/S3/L11/Index2018.csv'
df_comp = pd.read_csv(url) 
df = df_comp.copy()

### Length of the Time Period

In [24]:
df['date'] = pd.to_datetime(df['date'], dayfirst=True)

In [25]:
df.head()

        date     spx      dax     ftse    nikkei
0 1994-01-07  469.90  2224.95  3445.98  18124.01
1 1994-01-10  475.27  2225.00  3440.58  18443.44
2 1994-01-11  474.13  2228.10  3413.77  18485.25
3 1994-01-12  474.17  2182.06  3372.02  18793.88
4 1994-01-13  472.47  2142.37  3360.01  18577.26

In [26]:
df['date'].describe(datetime_is_numeric=True)

count                             6269
mean     2006-01-14 19:36:59.492742144
min                1994-01-07 00:00:00
25%                2000-01-11 00:00:00
50%                2006-01-12 00:00:00
75%                2012-01-19 00:00:00
max                2018-01-29 00:00:00
Name: date, dtype: object

### Setting the Index

In [27]:
df.set_index("date", inplace=True)

In [28]:
df.head()

               spx      dax     ftse    nikkei
date
1994-01-07  469.90  2224.95  3445.98  18124.01
1994-01-10  475.27  2225.00  3440.58  18443.44
1994-01-11  474.13  2228.10  3413.77  18485.25
1994-01-12  474.17  2182.06  3372.02  18793.88
1994-01-13  472.47  2142.37  3360.01  18577.26

In [29]:
df.date.describe()

AttributeError: 'DataFrame' object has no attribute 'date'

### Setting the Desired Frequency

    'h' - hourly
    'w' - weekly
    'd' - daily
    'm' - monthly
    'a' - annual
    'b' - business days

In [30]:
df = df.asfreq('d')

    8th and 9th Jan are saturdays and sundays which are not business days

In [31]:
df.head()

               spx      dax     ftse    nikkei
date
1994-01-07  469.90  2224.95  3445.98  18124.01
1994-01-08     NaN      NaN      NaN       NaN
1994-01-09     NaN      NaN      NaN       NaN
1994-01-10  475.27  2225.00  3440.58  18443.44
1994-01-11  474.13  2228.10  3413.77  18485.25

In [32]:
df = df.asfreq('b')

In [33]:
df.head()

               spx      dax     ftse    nikkei
date
1994-01-07  469.90  2224.95  3445.98  18124.01
1994-01-10  475.27  2225.00  3440.58  18443.44
1994-01-11  474.13  2228.10  3413.77  18485.25
1994-01-12  474.17  2182.06  3372.02  18793.88
1994-01-13  472.47  2142.37  3360.01  18577.26

### Handling Missing Values

    Setting the frequency to 'business days' must have generated 8 dates for which we have no data available

In [34]:
df.isna().sum()

spx       8
dax       8
ftse      8
nikkei    8
dtype: int64

    we have assigned 1 Jan for the various years as business days in which we have no data

In [36]:
df[df.isna().any(axis=1)]

            spx  dax  ftse  nikkei
date
2008-01-01  NaN  NaN   NaN     NaN
2009-01-01  NaN  NaN   NaN     NaN
2010-01-01  NaN  NaN   NaN     NaN
2013-01-01  NaN  NaN   NaN     NaN
2014-01-01  NaN  NaN   NaN     NaN
2015-01-01  NaN  NaN   NaN     NaN
2016-01-01  NaN  NaN   NaN     NaN
2018-01-01  NaN  NaN   NaN     NaN

    types of .fillna() methods:
    i.   Front Filling
    ii.  Back Filling
    iii. Assigning same value i.e. the mean (bad idea for time series)

    Front filling for spx

In [37]:
df['spx'] = df['spx'].fillna(method='ffill')

    Checking if filling the na's is correctly done

In [38]:
df.isna().sum()

spx       0
dax       8
ftse      8
nikkei    8
dtype: int64

    Back filling for ftse

In [39]:
df['ftse'] = df['ftse'].fillna(method='bfill')

In [ ]:
df.isna().sum()

    Mean

In [40]:
df['dax'] = df['dax'].fillna(value=df['dax'].mean())

In [41]:
df.isna().sum()

spx       0
dax       0
ftse      0
nikkei    8
dtype: int64

### Simplifying the Dataset

In [42]:
df['market_value'] = df['spx']

In [43]:
df.describe()

               spx           dax         ftse        nikkei  market_value
count  6277.000000   6277.000000  6277.000000   6269.000000   6277.000000
mean   1288.642547   6080.063363  5423.690398  14597.055700   1288.642547
std     487.868210   2752.604984  1145.568370   4043.122953    487.868210
min     438.920000   1911.700000  2876.600000   7054.980000    438.920000
25%     992.715221   4070.460000  4487.880000  10709.290000    992.715221
50%    1233.761241   5774.380000  5663.300000  15028.170000   1233.761241
75%    1460.250000   7442.660000  6304.630175  17860.470000   1460.250000
max    2872.867839  13559.600000  7778.637689  24124.150000   2872.867839

In [44]:
del df['spx']

In [45]:
df.describe()

                dax         ftse        nikkei  market_value
count   6277.000000  6277.000000   6269.000000   6277.000000
mean    6080.063363  5423.690398  14597.055700   1288.642547
std     2752.604984  1145.568370   4043.122953    487.868210
min     1911.700000  2876.600000   7054.980000    438.920000
25%     4070.460000  4487.880000  10709.290000    992.715221
50%     5774.380000  5663.300000  15028.170000   1233.761241
75%     7442.660000  6304.630175  17860.470000   1460.250000
max    13559.600000  7778.637689  24124.150000   2872.867839

In [46]:
del df['dax'], df['ftse'], df['nikkei']

In [47]:
df.describe()

       market_value
count   6277.000000
mean    1288.642547
std      487.868210
min      438.920000
25%      992.715221
50%     1233.761241
75%     1460.250000
max     2872.867839

### Splitting the Data

In [49]:
size = int(0.8 * len(df))
size

5021

In [52]:
df_train = df.iloc[:size]
df_fit = df.iloc[size:]

print(len(df_train), len(df_fit))

5021 1256

In [53]:
df_train.tail()

            market_value
date
2013-04-01   1562.173837
2013-04-02   1570.252238
2013-04-03   1553.686978
2013-04-04   1559.979316
2013-04-05   1553.278930

In [54]:
df_fit.head()

            market_value
date
2013-04-08   1563.071269
2013-04-09   1568.607909
2013-04-10   1587.731827
2013-04-11   1593.369863
2013-04-12   1588.854623